{
   "skillset":{
      "trees":[
         {
            "name":"Warfare",
            "skills":[
               {
                  "name":"Rapid Fire",
                  "description":"You fire a rapid burst of projectiles that force enemies back and strip away their armor. The intial range is 7 meters.",
                  "tiers":[
                     "Errant shots are added every other shot",
                     "Range extended to 12 meters",
                     "Targets are ignited for 4 seconds"
                  ]
               },
               {
                  "name":"Rune Vault",
                  "description":"You vault swiftly backward, away from your target. This vault leaves behind a mystic sigil that damages and blinds foes in a 4 meter radius.",
                  "tiers":[
                     "Sigil radius extended to 5 meters. Blindness extended to 4 seconds. Allows use of health and mana steal abilities.",
                     "Knockback added. Blindness extended to 5 seconds. Allows use of all weapon-based abilities.",
                     "Radius extended to 6 meters. Blindness extended to 6 seconds. Builds Charge."
                  ]
               },
               {
                  "name":"Chaos Burst",
                  "description":"You fire a trio of chaotic, ricocheting projectiles.",
                  "tiers":[
                     "Missile speed increased 50%",
                     "Missiles have a 30% chance to poison their target",
                     "2 additional missiles per burst"
                  ]
               },
               {
                  "name":"Cursed Daggers",
                  "description":"You fling 9 piercing daggers in a wide arc, which poison and cripple many foes at once, reducing the damage they deal.",
                  "tiers":[
                     "Number of daggers increased to 11. You gain .5% increased move speed per enemy hit for 4 seconds.",
                     "Number of daggers increased to 13. You gain .5% critical hit chance per enemy hit for 4 seconds.",
                     "Number of daggers increased to 15. You gain .5% critical hit chance per enemy hit for 4 seconds."
                  ]
               },
               {
                  "name":"Vortex Hex",
                  "description":"You summon a fetish which draws nearby foes toward it and has a chance to stun them. A maximum of 3 foes may be drawn at one time.  Max stun chance of 8%.",
                  "tiers":[
                     "Foes are damaged when drawn",
                     "Up to five foes can be drawn at one time",
                     "Drawn foes transfer Mana to caster"
                  ]
               },
               {
                  "name":"Shattering Glaive",
                  "description":"You hurl a throwing glaive, which shatters on impact, damaging and slowing all foes within 4.5 meters.",
                  "tiers":[
                     "Adds a 25% chance that targets will flee for 3 seconds",
                     "Detonation size increased to 6 meters",
                     "Fire trails emanate from the point of detonation"
                  ]
               },
               {
                  "name":"Venemous Hail",
                  "description":"You fire a flurry of poisonous bolts skyward, which streak to earth in a 4 meter radius around the target location. The hail hits with 8 waves per flurry.",
                  "tiers":[
                     "Impact radius increased to 5.5 meters",
                     "Duration of flurry increased to 12 waves",
                     "Shatters shields"
                  ]
               },
               {
                  "name":"Long Range Mastery",
                  "description":"Your expertise increases damage with all ranged weapons. Bows, crossbows, pistols and wands have increased firing distance."
               },
               {
                  "name":"Shotgonne Mastery",
                  "description":"Your expertise with shotgonnes increases the chance that your blasts shock and disorient your targets."
               },
               {
                  "name":"Akimbo",
                  "description":"Your skill with pistols enables you to deal more damage when wielding two at once and occasionally fire both simultaneously... to deadly effect."
               }
            ]
         },
         {
            "name":"Lore",
            "skills":[
               {
                  "name":"Glaive Throw",
                  "description":"You hurl a throwing glaive, slicing through your target, rebounding once to strike additional foes, and generating extra Charge.",
                  "tiers":[
                     "The Glaive rebounds 2 times",
                     "The Glaive rebounds 3 times",
                     "The Glaive rebounds 4 times"
                  ]
               },
               {
                  "name":"Tangling Shot",
                  "description":"You fire a cursed projectile that binds and immobilizes your target. Enemies within a 3.5 meter radius of your target have a secondary chance of also being entangled. Entangled foes are slowly crushed, taking damage over time.",
                  "tiers":[
                     "Secondary radius extended to 4.5 meters, and immobilize chance raised to 65%",
                     "Secondary radius extended to 5.5 meters, and immobilize chance raised to 80%",
                     "Secondary radius extended to 6.5 meters, and immobilize chance raised to 95%"
                  ]
               },
               {
                  "name":"Glaive Sweep",
                  "description":"You sweep your glaive in a 360 degree arc, knocking back and stunning foes within 4 meters, while generating additional Charge for each enemy struck.",
                  "tiers":[
                     "Targets bleed",
                     "Range increased to 5.5 meters",
                     "Stun chance increased to 95%"
                  ]
               },
               {
                  "name":"Sandstorm",
                  "description":"You hurl your glaive, generating a whirlwind that cuts through foes and saps their health. The sandstorm travels 20 meters and generates 1.5% of your charge bar Charge for every enemy hit.",
                  "tiers":[
                     "Killed foes emit clouds of plague flies",
                     "Range extended to 40 meters",
                     "Range extended to 50 meters"
                  ]
               },
               {
                  "name":"Bramble Wall",
                  "description":"You call forth a wall of thorned vines that prevent foes from approaching",
                  "tiers":[
                     "Vines damage foes when raised",
                     "Vine length increased",
                     "Vines exude a poison gas"
                  ]
               },
               {
                  "name":"Burning Leap",
                  "description":"You execute a fiery, spinning leap, up to 7 meters forward. Any foes hit along the way are knocked back and set aflame.",
                  "tiers":[
                     "10% faster to cast and range extended to 9 meters",
                     "20% faster to cast and range extended to 11 meters",
                     "30% faster to cast and range extended to 13 meters"
                  ]
               },
               {
                  "name":"Flaming Glaive",
                  "description":"You hurl two flaming glaives that circle outward in concentric rings, slashing all foes in range and setting them alight.",
                  "tiers":[
                     "Glaive size increased, allowing it to strike more accurately",
                     "Struck enemies are 30% more vulnerable to Fire and Poison damage",
                     "Struck enemies are 45% more vulnerable to Fire and Poison Damage"
                  ]
               },
               {
                  "name":"Dodge Mastery",
                  "description":"Your acrobatic training increases your odds of dodging a blow."
               },
               {
                  "name":"Poison Burst",
                  "description":"You coat your weapons with a venomous agent. If an enemy is killed, there is a chance it will explode in a 6 meter cloud of poison, damaging enemies that come into contact with it."
               },
               {
                  "name":"Share the Wealth",
                  "description":"You share a percentage of your Charge benefits with all pets and allies within 16 meters, and you gain the same percentage as an additional bonus to your own benefits."
               }
            ]
         },
         {
            "name":"Sigil",
            "skills":[
               {
                  "name":"Blade Pact",
                  "description":"You invoke an ancient curse that slows your foes and undermines their defenses. The Blade Pact lasts for seven seconds, and any enemy passing through the pact's area suffers the effects for the listed duration.",
                  "tiers":[
                     "The pact lasts for 9 seconds",
                     "The pact lasts for 11 seconds",
                     "The pact lasts for 13 seconds"
                  ]
               },
               {
                  "name":"Shadowshot",
                  "description":"You curse your ammunition, causing it to split into 3 shards upon impact, which seek additional targets.",
                  "tiers":[
                     "Ammo splits into 4 shards",
                     "Ammo splits into 5 shards",
                     "Ammo splits into 6 shards"
                  ]
               },
               {
                  "name":"Bane Breath",
                  "description":"A blast of cursed breath poisons enemies. If they are killed, they are converted into Shadowling Fiends that fight for you for ten seconds. Note that the Death Ritual skill improves all Shadowling summon duration and attack power.",
                  "tiers":[
                     "Shadowlings move and attack 10% faster",
                     "Shadowlings move and attack 20% faster",
                     "Shadowlings move and attack 30% faster"
                  ]
               },
               {
                  "name":"Repulsion Hex",
                  "description":"You summon a floating hex avatar, which repulses enemies who draw too near.",
                  "tiers":[
                     "The hex has a 10% chance to cause enemies to flee for 5 seconds",
                     "The hex has a 20% chance to cause enemies to flee for 5 seconds",
                     "The hex has a 30% chance to cause enemies to flee for 5 seconds"
                  ]
               },
               {
                  "name":"Stone Pact",
                  "description":"You invoke an ancient curse that protects you and your allies from physical and elemental damage and reflects some damage back on your attackers. The Stone Pact lasts for twenty seconds, and any ally passing through the pact's area benefits from its effects for the listed duration.",
                  "tiers":[
                     "The pact reflects 25% of damage back at attacking monsters",
                     "The pact reflects 50% of damage back at attacking monsters",
                     "The pact reflects 75% of damage back at attacking monsters"
                  ]
               },
               {
                  "name":"Shadowmantle",
                  "description":"You call forth a shadow hex protecting you from ranged attackers. The shadowmantle can reflect damage back to the attackers, and it has a chance to blind them for 6 seconds.",
                  "tiers":[
                     "The hex reflects 125% of the missile damage",
                     "The hex reflects 175% of the missile damage",
                     "The hex reflects 250% of the missile damage"
                  ]
               },
               {
                  "name":"Shadowling Brute",
                  "description":"You call forth a terrifying Shadowling Brute at the target location, which lays waste to your enemies.",
                  "tiers":[
                     "Brute gains dash attack",
                     "Brute gains leap attack",
                     "Brute attack rate is increased 30%"
                  ]
               },
               {
                  "name":"Master of the Elements",
                  "description":"Your expertise with the elements allows you to deal more damage with them. Poison receives twice the benefit of the other elements."
               },
               {
                  "name":"Shadowling Ammo",
                  "description":"You curse your ammunition, causing it to split into 3 shards upon impact, which seek additional targets.",
                  "tiers":[
                     "Ammo splits into 4 shards",
                     "Ammo splits into 5 shards",
                     "Ammo splits into 6 shards"
                  ]
               },
               {
                  "name":"Death Ritual",
                  "description":"Your Shadowling allies last longer and deal more damage."
               }
            ]
         }
      ]
   }
}
